// pages/jobdetail/jobdetail.js
Page({

  /**
   * 页面的初始数据
   */
  data: {
    jobTitle: '全面建成小康社会',
    tabs:['有钱','任性','好玩'],
    rmb: '22',
    weizhi: '天津',
    xuewei: '大学本科',
    xueli: '学历不限',
    jobDescription: '1、18-25岁，有志青年男女2、外向健谈，应变能力强，积极主动，有较好的沟通能力3、对创业有强烈欲望,并能完全展现个人能力者4、反应敏捷，表达能力强，具有亲和力5、应届毕业生、退伍军人优先录用1、18-25岁，有志青年男女2、外向健谈，应变能力强，积极主动，有较好的沟通能力3、对创业有强烈欲望,并能完全展现个人能力者4、反应敏捷，表达能力强，具有亲和力5、应届毕业生、退伍军人优先录用1、18-25岁，有志青年男女2、外向健谈，应变能力强，积极主动，有较好的沟通能力3、对创业有强烈欲望,并能完全展现个人能力者4、反应敏捷，表达能力强，具有亲和力5、应届毕业生、退伍军人优先录用1、18-25岁，有志青年男女2、外向健谈，应变能力强，积极主动，有较好的沟通能力3、对创业有强烈欲望,并能完全展现个人能力者4、反应敏捷，表达能力强，具有亲和力5、应届毕业生、退伍军人优先录用'
  },
  ilike(){
    console.log(111)
  },
  /**
   * 生命周期函数--监听页面加载
   */
  onLoad: function (options) {

  },

  /**
   * 生命周期函数--监听页面初次渲染完成
   */
  onReady: function () {

  },

  /**
   * 生命周期函数--监听页面显示
   */
  onShow: function () {

  },

  /**
   * 生命周期函数--监听页面隐藏
   */
  onHide: function () {

  },

  /**
   * 生命周期函数--监听页面卸载
   */
  onUnload: function () {

  },

  /**
   * 页面相关事件处理函数--监听用户下拉动作
   */
  onPullDownRefresh: function () {

  },

  /**
   * 页面上拉触底事件的处理函数
   */
  onReachBottom: function () {

  },

  /**
   * 用户点击右上角分享
   */
  onShareAppMessage: function () {

  }
})